Revit 2024 API
Zone.Perimeter Property
Get the Perimeter of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Perimeter { get; }
Visual Basic
Public ReadOnly Property Perimeter As Double
	Get
Visual C++
public:
property double Perimeter {
	double get ();
}
Remarks
This property is used to get the Perimeter of the Zone.
See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace